import { createFileRoute, Link } from "@tanstack/react-router";
import { Image } from "@unpic/react";

export const Route = createFileRoute("/guides")({
  component: RouteComponent,
});

function RouteComponent() {
  return (
    <div className="fixed inset-0 bg-white overflow-auto font-mono">
      <div className="flex justify-center py-2">
        <div className="w-full max-w-xl px-2">
          <div className="bg-[#fafaf0]">
            <div className="bg-[#006CFF] p-0.5">
              <Link to="/">
                <Image
                  src="/babel-logo-text.png"
                  width={150}
                  height={30}
                  layout="fixed"
                  alt="Babel Logo"
                  className="max-w-[120px] h-auto"
                />
              </Link>
            </div>

            <div className="px-3 py-2">
              <div className="mb-3">
                <h1 className="text-sm font-bold mb-1">إرشادات بابل</h1>
                <p className="text-[9px] text-gray-600">
                  <em>
                    هذه القواعد مأخوذة مباشرة من Hacker News وتم تكييفها
                    لمجتمعنا
                  </em>
                </p>
              </div>

              <div className="space-y-2">
                <section>
                  <h2 className="font-bold text-xs mb-1">ماذا تنشر</h2>
                  <div className="space-y-1 text-[10px] leading-tight">
                    <p>
                      <strong>داخل الموضوع:</strong> أي شيء قد يجده المبرمجون
                      الجيدون مثيراً للاهتمام. يشمل ذلك أكثر من البرمجة والشركات
                      الناشئة. إذا كان عليك تقليله إلى جملة، قد تكون الإجابة: أي
                      شيء يشبع فضول المرء الفكري.
                    </p>
                    <p>
                      <strong>خارج الموضوع:</strong> معظم القصص حول السياسة، أو
                      الجريمة، أو الرياضة، أو المشاهير، ما لم تكن دليلاً على
                      ظاهرة جديدة مثيرة للاهتمام. مقاطع فيديو للسقوط أو الكوارث،
                      أو صور حيوانات لطيفة. إذا كانوا سيغطونها في أخبار
                      التلفزيون، فمن المحتمل أنها خارج الموضوع.
                    </p>
                  </div>
                </section>

                <section>
                  <h2 className="font-bold text-xs mb-1">في المنشورات</h2>
                  <div className="space-y-1 text-[10px] leading-tight">
                    <p>
                      من فضلك لا تفعل أشياء لجعل العناوين بارزة، مثل استخدام
                      الأحرف الكبيرة أو علامات التعجب، أو القول كم أن المقال
                      رائع. إنه ضمني في تقديم شيء ما أنك تعتقد أنه مهم.
                    </p>
                    <br />

                    <p>
                      من فضلك قدم المصدر الأصلي. إذا كان المنشور يُبلغ عن شيء
                      موجود على موقع آخر، قدم الأخير.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تستخدم بابل بشكل أساسي للترويج. لا بأس من نشر
                      أشيائك الخاصة في بعض الأحيان، ولكن الاستخدام الأساسي
                      للموقع يجب أن يكون للفضول.
                    </p>
                    <br />

                    <p>
                      إذا كان العنوان يتضمن اسم الموقع، من فضلك احذفه، لأن اسم
                      الموقع سيتم عرضه بعد الرابط.
                    </p>
                    <br />

                    <p>
                      إذا كان العنوان يحتوي على رقم أو رقم + صفة غير ضروري،
                      سنقدر إذا قمت بقصه. على سبيل المثال، ترجم "10 طرق للقيام
                      بـ X" إلى "كيفية القيام بـ X"، و"14 Y مذهل" إلى "Ys".
                      استثناء: عندما يكون الرقم ذا معنى، على سبيل المثال
                      "الأشكال الأفلاطونية الخمسة".
                    </p>
                    <br />

                    <p>
                      خلاف ذلك، من فضلك استخدم العنوان الأصلي، ما لم يكن مضللاً
                      أو clickbait؛ لا تضف تعليقاتك التحريرية.
                    </p>
                    <br />

                    <p>
                      إذا قدمت فيديو أو pdf، من فضلك حذرنا بإضافة [video] أو
                      [pdf] إلى العنوان.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تنشر على بابل لتسألنا أو تخبرنا بشيء. أرسله إلى
                      البريد الإلكتروني للدعم.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تحذف وتعيد النشر. الحذف للأشياء التي لم يكن يجب
                      تقديمها في المقام الأول.
                    </p>
                    <br />

                    <p>
                      لا تطلب تصويتات، أو تعليقات، أو منشورات. يجب على
                      المستخدمين التصويت و التعليق عندما يصادفون شيئاً يجدونه
                      شخصياً مثيراً للاهتمام—وليس للترويج.
                    </p>
                    <br />
                  </div>
                </section>

                <section>
                  <h2 className="font-bold text-xs mb-1" id="comments">
                    في التعليقات
                  </h2>
                  <div className="space-y-1 text-[10px] leading-tight">
                    <p>
                      كن لطيفاً. لا تكن ساخراً. تحاور بفضول؛ لا تستجوب. احذف
                      التعليقات اللاذعة.
                    </p>
                    <br />

                    <p>
                      يجب أن تصبح التعليقات أكثر تفكيراً وموضوعية، وليس أقل، مع
                      ازدياد انقسام الموضوع.
                    </p>
                    <br />

                    <p>
                      عند الاختلاف، من فضلك رد على الحجة بدلاً من التنابز. "هذا
                      أحمق؛ 1 + 1 يساوي 2، وليس 3" يمكن اختصارها إلى "1 + 1
                      يساوي 2، وليس 3".
                    </p>
                    <br />

                    <p>
                      لا تكن متذمراً. النقد المدروس جيد، لكن من فضلك لا تكن سلبياً
                      بشكل جامد أو عام.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تثر الغضب. من فضلك لا تسخر، بما في ذلك من بقية
                      المجتمع.
                    </p>
                    <br />

                    <p>
                      من فضلك رد على أقوى تفسير معقول لما يقوله شخص ما، وليس على
                      تفسير أضعف يسهل انتقاده. افترض حسن النية.
                    </p>
                    <br />

                    <p>
                      تجنب إشعال الفتن. تجنب المماسات العامة. احذف مصطلحات
                      الإنترنت.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تنشر رفضاً سطحياً، خاصة لعمل الآخرين. التعليق
                      النقدي الجيد يعلمنا شيئاً.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تستخدم بابل للمعركة السياسية أو الأيديولوجية.
                      إنه يدوس الفضول.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تعلق على ما إذا كان شخص ما قد قرأ مقالاً. "هل
                      قرأت المقال حتى؟ إنه يذكر ذلك" يمكن اختصارها إلى "المقال
                      يذكر ذلك".
                    </p>
                    <br />

                    <p>
                      من فضلك لا تختر أكثر شيء استفزازي في مقال أو منشور للشكوى
                      منه في المنشور. ابحث عن شيء مثير للاهتمام للرد عليه بدلاً
                      من ذلك.
                    </p>
                    <br />

                    <p>
                      الحسابات المؤقتة مقبولة للمعلومات الحساسة، لكن من فضلك لا
                      تنشئ حسابات بشكل روتيني. بابل مجتمع—يجب أن يكون للمستخدمين
                      هوية يمكن للآخرين الارتباط بها.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تستخدم الأحرف الكبيرة للتأكيد. إذا كنت تريد
                      التأكيد على كلمة أو عبارة، ضع *نجمات* حولها وستصبح مائلة.
                      (قيد التطوير)
                    </p>
                    <br />

                    <p>
                      من فضلك لا تنشر تلميحات حول التلاعب، أو الترويج المدفوع،
                      أو الحشد، أو العملاء الأجانب، وما شابه ذلك. إنه يحط من قدر
                      النقاش وعادة ما يكون خاطئاً. إذا كنت قلقاً بشأن سوء
                      الاستخدام، راسل احد الاداريين وسننظر في البيانات.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تشتكي من أن منشوراً غير مناسب. إذا كانت القصة
                      spam أو خارج الموضوع، ضع علامة عليها. لا تغذي التعليقات
                      الشنيعة بالرد؛ ضع علامة عليها بدلاً من ذلك. إذا وضعت علامة،
                      من فضلك لا تعلق أيضاً أنك فعلت ذلك.
                    </p>
                    <br />

                    <p>
                      من فضلك لا تشتكي من المضايقات المماسة—على سبيل المثال
                      تنسيقات المقالات أو المواقع، أو تصادمات الأسماء، أو كسر زر
                      الرجوع. إنها شائعة جداً لتكون مثيرة للاهتمام.
                    </p>
                    <br />
                    <p>
                      من فضلك لا تعلق على التصويت على التعليقات. إنه لا يفعل أي
                      خير أبداً، ويجعل القراءة مملة.
                    </p>
                  </div>
                </section>

                <div className="mt-3 pt-1 border-t-2 border-[#006CFF]">
                  <div className="text-center text-[9px] text-gray-600 py-1">
                    <a href="/" className="text-[#006CFF] hover:underline">
                      العودة للرئيسية
                    </a>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
